pimpleFoam_snappyHex/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 5.39e-7;

boundaryField
{
    topPatch
    {
        type            zeroGradient;
    }
    wall
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    bottomPatch
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.07;
	value		$internalField;    
    }
}


// ************************************************************************* //
